Repository: AaronFeledy/d9-drupal-check-allthemodules
Catalog: web/modules/contrib/role_paywall/translations/role_paywall.*.po
Languages: de

source: Role paywall
de: Rollenbasierte Paywall

source: Paywall configuration
de: Paywall-Kofiguration

source: Premium subscription
de: jetzt abonnieren

source: 30-days free trial subscription
de: jetzt testen

source: Article test
de: Artikel-Test

source: Article test configuration
de: Artikel-Test-Konfiguration

source: Subsequent 1-article-test wait period (in days)
de: Wartezeit zwischen Artikel-Tests (in Tagen)

source: Roles with premium access
de: Benutzerrollen mit Premiumzugang

source: Content to hide
de: Zu verbergende Inhalte

source: Field to mark @bundle as premium
de: Feld zur Kennzeichnung von @bundle als Premium-Inhalt

source: Fields to hide in @bundle
de: Felder zum Verstecken in @bundle

source: A boolean field in @bundle is required. The field will mark if each node is premium and the fields have to be hidden or not
de: Ein Boolean-Feld ist in @bundle erforderlich. Dieses Feld kennzeichnet, ob ein Inhalt premium ist und Inhalte verborgen werden müssen.

source: Continue reading?
de: Weiterlesen?

source: You cannot access to this content. You can <a href="/shop">purchase a subscription</a>
de: Sie können auf diesen Inhalt nicht zugreifen. Sie können dazu ein Abonnement abschließen
