Repository: AaronFeledy/d9-drupal-check-allthemodules
Catalog: web/modules/contrib/commerce_pagseguro_transp/commerce_pagseguro_transp.*.po
Languages: pt_br

source: A Pagseguro account valid email
pt_br: Um email válido da conta do PagSeguro

source: The production token of Pagseguro
pt_br: O token de produção do PagSeguro

source: The sandbox token of Pagseguro
pt_br: Token do sandbox do PagSeguro

source: The sandbox buyer email of Pagseguro
pt_br: Email do comprador no sandbox do PagSeguro

source: No interest installment quantity
pt_br: Quantidade de parcelas sem juros

source: Birthdate Field on User
pt_br: Campo data de nascimento no usuário

source: CPF Field on User
pt_br: Campo CPF no usuário

source: Full Name Field on User
pt_br: Campo nome completo no usuário

source: Telephone Field on User
pt_br: Campo telefone no usuário

source: -- Select an option --
pt_br: -- Selecione uma opção --

source: Click here to proceed with payment
pt_br: Clique aqui para prosseguir com o pagamento

source: Bank Ticket
pt_br: Boleto Bancário

source: The CPF number
pt_br: Número do CPF

source: The CPF number of card holder
pt_br: O número CPF do titular do cartão

source: The sender hash code returned by Pagseguro
pt_br: O código sender hash retornado pelo Pagseguro

source: Payment link
pt_br: Link para pagamento

source: The link for payment
pt_br: O link para pagamento

source: Holder name
pt_br: Nome do titular

source: The name of card holder
pt_br: O nome do titular exatamente como no cartão

source: Installment amount
pt_br: Valor da parcela

source: The installment amount
pt_br: O valor da parcela

source: Installments quantity
pt_br: Quantidade de parcelas

source: The installments quantity
pt_br: A quantidade de parcelas

source: Banks
pt_br: Bancos

source: Select the bank
pt_br: Selecione o banco

source: Installments
pt_br: Parcelas

source: Select the installments quantity...
pt_br: Escolha a quantidade de parcelas...

source: Select the installments quantity.
pt_br: Escolha a quantidade de parcelas.
