Repository: AaronFeledy/d9-drupal-check-allthemodules
Catalog: web/modules/contrib/microspid/translations/*.po
Languages: it

source: MicroSPiD configuration handler
it: Controlla le diverse configurazioni del modulo di autenticazione SPID

source: Enable this user to leverage SPID authentication
it: Consentire a questo utente di sfruttare l'autenticazione SPID

source: WARNING: if unchecked, this will become a local Drupal user, which might be denied access based on the MicroSPiD settings for authenticating local Drupal accounts.<br />Don't use this setting for access control, which should be configured in your IdP instead.<br />NOTE: if the configuration option 'Automatically enable SAML authentication for existing users upon successful login' is activated, this Drupal account can become linked with SAML (again) when the user succesfully authenticates to the IdP.
it: Attenzione: se non spuntato, questo diventerà un utente locale di Drupal, a cui potrebbe essere negato l'accesso in base alle impostazioni di microSPiD per l'autenticazione degli account Drupal locali. <br /> non utilizzare questa impostazione per il controllo di accesso, che deve invece essere configurata nell'IdP. <br /> Nota: se l'opzione di configurazione "Abilita automaticamente l'autenticazione SAML per gli utenti esistenti al momento del successo login è attivata, questo account Drupal può essere collegato con SAML (di nuovo) quando l'utente autentica correttamente l'IdP.

source: Unable to move the microspid template to your files folder, please check file permissions and move the directory %from to %to
it: Impossibile spostare il template microspid nella cartella files, controllare le autorizzazioni dei file e spostare la directory da %from a %to

source: MicroSPiD authentication is NOT activated
it: L'autenticazione microSPiD non è attivata

source: It can be activated on the <a href="@config_page">configuration page</a>.
it: Può essere attivato sulla <a href="@config_page">pagina di configurazione</a>.

source: Handles authentication with spid protocol
it: Permette l'autenticazione per mezzo del protocollo SPID

source: MicroSPiD configuration
it: Configurazione MicroSPiD

source: Control the various settings of the MicroSPiD authentication module
it: Controlla le varie impostazioni del modulo MicroSPiD

source: Settings
it: Impostazioni

source: Basic settings
it: Impostazioni di base

source: Local authentication
it: Autenticazione locale

source: User info and syncing
it: Informazioni e sincronizzazione

source: Change SPID authentication setting for individual accounts
it: Modificare l'impostazione di autenticazione SPID per singoli account

source: Allow users to enable or disable SPID authentication per user on user edit forms.
it: Consentire agli utenti di abilitare o disabilitare l'autenticazione SPID per utente sui moduli di modifica utente.

source: Spid certificate creation
it: Crea certificato SPiD

source: Language code
it: Codice della lingua

source: Site default language code
it: Codice lingua predefinita del sito

source: Activate authentication via MicroSPiD
it: Attivare l'autenticazione via MicroSPiD

source: MicroSPiD attribute to be used as email address for the user
it: Attributo SPiD da utilizzare come indirizzo email per l'utente

source: Role population
it: Popolamento di ruoli

source: Automatic role population from MicroSPiD attributes
it: Popolamento automatico dei ruoli da attributi SPiD

source: Reevaluate roles every time the user logs in
it: Rivalutare i ruoli ogni volta che l'utente accede

source: Register users
it: Registra nuovi utenti

source: Drupal authentication
it: Autenticazione Drupal

source: Allow SAML users to set Drupal passwords
it: Consenti agli utenti SAML di impostare le password di Drupal

source: Allow authentication with local Drupal accounts
it: Consenti autenticazione con gli account Drupal locali

source: Roles to be allowed to log in locally
it: Ruoli a cui consentire di accedere localmente

source: role
it: ruolo

source: Users to be allowed to log in locally
it: Utenti a cui consentire di accedere localmente

source: Redirect users after logging out
it: Reindirizza gli utenti dopo la disconnessione

source: Synchronize options
it: Opzioni di sincronizzazione

source: Synchronize mail on every login
it: Sincronizzare la posta ad ogni login

source: Use fiscal number as username, else use "lastname.firstname"
it: Usa codice fiscale come username, altrimenti usa "cognome.nome"

source: Automatically enable SAML authentication for existing users upon successful login
it: Abilita automaticamente l'autenticazione SAML per gli utenti esistenti dopo l'accesso riuscito

source: Expand the level of Drupal logging to include debugging information
it: Espandi il livello di registrazione di Drupal per includere le informazioni di debug

source: Are you sure?
it: Sei sicuro?

source: SAML response not found
it: Risposta SPiD non trovata

source: error inflating response
it: errore decomprimendo la risposta

source: You have been logged out.
it: Logout effettuato con successo.

source: We were unable to log you out of all your sessions. To be completely sure that you are logged out, you need to close your web browser.
it: L'identity provider non consente di chiudere la sessione. Per essere sicuro di essere scollegato chiudere il browser web.

source: certificate not found
it: certificato non trovato

source: User %authname (%cf) authenticated via SPID
it: Utente %authname (%cf) autenticato via SPID

source: Click to activate SPID.
it: Spuntare per attivare il funzionamento del modulo.

source: Create certificate
it: Crea prima il certificato...

source: Activate authentication via MicroSPID
it: Attiva l'autenticazione per mezzo del protocollo SPID

source: Service index
it: Indice del servizio

source: Specify service index
it: Specifica l'indice del servizio, lasciare 0 se unico/primo servizio per il provider.

source: SP Entity ID
it: Entity ID del SP

source: If service is 0 leave unchanged else use service 0 value
it: Se indice servizio &egrave; 0, lasciare valore predefinito, altrimenti inserire valore del servizio 0.

source: Service path
it: Eventuale path del servizio

source: Service path/alias
it: Normalmente vuoto, altrimenti contiene path/alias del servizio (per es. per la pagina https://pa.gov.it/servizio scrivere 'servizio' senza virgolette).

source: private key path
it: Eventuale path chiave privata

source: private key path, only if you change it
it: Normalmente vuoto, altrimenti contiene path al percorso fuori dal web in cui sono da generare o sono state manualmente spostate la chiave privata e pubblica.<br />NOTA: solo per utenti esperti.

source: Use Header with: Cache-Control: no-cache
it: Usa intestazione con: Cache-Control: no-cache

source: Use a "Cache-Control: no-cache" header in the HTTP response to avoid the redirection be cached (e.g. when using a reverse-proxy layer).
it: Utilizzare un'intestazione "cache-Control: No-cache" nella risposta HTTP per evitare che il reindirizzamento venga memorizzato nella cache (ad esempio quando si utilizza un livello proxy inverso).

source: Do Single Logout
it: Eseguire il Single Logout

source: Enable Single Logout (only for level 1).
it: Abilitare il Single Logout (solo per il livello 1).

source: Test mode
it: Modalità di prova

source: Use testing idp.
it: Utilizzare IDP di test (Agid)

source: Turn on debugging messages
it: Attivare i messaggi di debug

source: Expand the level of Drupal logging to include debugging information.
it: Espandi il livello di registrazione di Drupal per includere le informazioni di debug.

source: User Provisioning
it: Approvvigionamento utenti

source: Register users (i.e., auto-provisioning)
it: Registra nuovi utenti

source: Determines whether or not the module should automatically create/register new Drupal accounts for users that authenticate using MicroSPiD. Unless you've done some custom work to provision Drupal accounts with the necessary authmap entries you will want this checked.<br /><br />NOTE: If unchecked each user must already have been provisioned a Drupal account correctly linked to the SAML authname attribute (e.g. by creating Drupal users with "Enable this user to leverage SAML authentication" checked). Otherwise they will receive a notice and be denied access.
it: Determina se il modulo deve creare o registrare automaticamente nuovi account Drupal per gli utenti che eseguono l'autenticazione utilizzando microSPiD. <br /> <br /> Nota: Se deselezionata per ogni utente deve essere già stato eseguito un account Drupal correttamente collegato al codice fiscale (usandolo come nome utente o inserendolo nel campo apposito e configurato).

source: Update IDPs metadata
it: Aggiorna i metadati degli IDP

source: Multi portal setup
it: Impostazioni multi-portale

source: Metadata generation for multi-portal
it: Produzione metadati multi-portale

source: A list of <strong>other</strong> services, one per line, in the form index|acs-location|service-name|service-description|extra-attributes. Default attributes are spidCode,name,familyName,fiscalNumber,email. Service 0 is not listed, so index starts from 1. Extra attributes are separated by colon. Example:<br /><em>1|https://miosito.it/cartella/microspid_acs|service-2|Service number 2|companyName:ivaCode</em>
it: Lista degli <strong>altri</strong> servizi, uno per linea, nella forma index|acs-location|service-name|service-description|extra-attributes.Gli attributi predefiniti sono spidCode,name,familyName,fiscalNumber,email. L'indice 0 non va inserito, quindi si parte da 1. Gli attributi aggiuntivi sono separati da due punti. Esempio:<br /><em>1|https://miosito.it/cartella/microspid_acs|service-2|Service number 2|companyName:ivaCode</em><br />NOTA: il servizio 0 non va inserito, quindi se c'è un solo servizio lasciare il campo vuoto; stessa cosa se il servizio corrente è diverso da 0.

source: Save infos as metadata
it: Generare i metadati

source: WARNING: your metadata will be regenerated! Are you sure?
it: ATTENZIONE: i tuoi metadati saranno rigenerati! sicuro di procedere?

source: IDP metadata have been updated
it: I metadati degli IDP sono stati aggiornati

source: Error: IDP metadata NOT updated!
it: Errore: metadati degli IDP NON aggiornati!

source: Your metadata have been generated.
it: I tuoi metadati sono stati rigenerati.

source: Folder %filepath doesn't exist
it: La cartella %filepath non esiste

source: Otherwise
it: Oppure

source: Save
it: Salva

source: Certificate has been created...
it: Il certificato &egrave; stato creato, &egrave; ora possibile attivare spid.

source: Check this box if you want to let people log in with local Drupal accounts (without using MicroSPiD). If you want to restrict this privilege to certain users you can enter the Drupal user IDs in the field below.
it: Seleziona questa casella se desideri che le persone accedano con gli account Drupal locali (senza utilizzare microSPiD). Se si desidera limitare questo privilegio a determinati utenti, è possibile immettere gli ID utente di Drupal nel campo sottostante.

source: Check this box if you want to let people set passwords for their local Drupal accounts. This will allow users to log in using either SAML or a local Drupal account. Disabling this removes the password change fields from the user profile form.<br/>NOTE: In order for them to login using their local Drupal password you must allow local logins with the settings below.
it: Selezionare questa casella se si desidera consentire alle persone di impostare le password per i propri account Drupal locali. Ciò consentirà agli utenti di accedere utilizzando sia SAML che un account Drupal locale. Disabilitando questo rimuove i campi di modifica della password dal modulo profilo utente. <br /> Nota: per poter accedere utilizzando la loro password locale Drupal è necessario consentire login locali con le impostazioni di seguito.

source: Which ROLES should be allowed to login with local accounts?
it: Quali ruoli devono essere autorizzati ad effettuare il login con gli account locali?

source: Roles that should be allowed to login without MicroSPiD. Examples are dev/admin roles or guest roles.
it: Ruoli che devono essere consentiti per l'accesso senza microSPiD. Gli esempi sono ruoli di dev/admin o ruoli Guest.

source: Which users should be allowed to login with local accounts?
it: Quali utenti dovrebbero essere autorizzati ad effettuare il login con gli account locali?

source: Example: <i>1,2,3</i><br />A comma-separated list of user IDs that should be allowed to login without MicroSPiD.
it: Esempio: <i> 1, 2, 3 </i> <br /> elenco separato da virgole di ID utente che dovrebbe essere consentito l'accesso senza microSPiD.

source: Redirect URL after logging out
it: Reindirizza URL dopo la disconnessione

source: Optionally, specify a URL for users to go to after logging out.
it: Facoltativamente, specificare un URL per cui gli utenti devono passare dopo la disconnessione.

source: Fiscal number as username
it: Utilizza il codice fiscale come nome utente

source: Checked if fiscal number is used as username.
it: Determina se il nome utente deve coincidere con il codice fiscale.<br />Altrimenti viene usata la formula "cognome.nome".

source: no field
it: nessun campo.

source: Field for name
it: Scegli il campo per nome

source: Select field for name
it: Campo da usare per NOME.

source: Field for family name
it: Scegli il campo per cognome

source: Select field for family name
it: Campo da usare per COGNOME.

source: Field for birth place
it: Scegli il campo per luogo di nascita

source: Select field for birth place
it: Campo da usare per luogo di nascita.

source: Field for province
it: Scegli il campo per provincia di nascita

source: Select field for province
it: Campo da usare per PROVINCIA DI NASCITA.

source: Field for birth date
it: Scegli il campo per data di nascita

source: Select field for birth date
it: Campo da usare per DATA DI NASCITA.

source: Field for fiscal number
it: Scegli il campo per codice fiscale

source: Select field for fiscal number
it: Campo da usare per CODICE FISCALE.

source: Example: <i>mail</i><br />If the user attribute is multivalued, the first value will be used.
it: Esempio: <i>email</i>

source: Synchronize email address on every login
it: Sincronizzare l'indirizzo e-mail ad ogni login

source: Check if email address should be synchronized every time a user logs in.
it: Spunta la casella se l'indirizzo email deve essere sincronizzato ogni volta che un utente effettua il log in.

source: A pipe separated list of rules. Each rule consists of a Drupal role id, a SimpleSAML attribute name, an operation and a value to match. <i>e.g. role_id1:attribute_name,operation,value|role_id2:attribute_name2,operation,value... etc</i><br /><br />Each operation may be either "@", "@=" or "~=". <ul><li>"=" requires the value exactly matches the attribute;</li><li>"@=" requires the portion after a "@" in the attribute to match the value;</li><li>"~=" allows the value to match any part of any element in the attribute array.</li></ul>For instance:<br /><i>staff:eduPersonPrincipalName,@=,uninett.no;affiliation,=,employee|admin:mail,=,andreas@uninett.no</i><br />would ensure any user with an eduPersonPrinciplaName SAML attribute matching .*@uninett.no would be assigned a staff role and the user with the mail attribute exactly matching andreas@uninett.no would assume the admin role.
it: Un elenco di regole separate da pipe. Ogni regola è costituita da un ID ruolo Drupal, un nome di attributo SPID, un'operazione e un valore da abbinare. <i> ad esempio role_id1:ATTRIBUTE_NAME,operazione,valore|role_id2:attribute_name2,operazione,valore... etc </i> <br /> <br /> ogni operazione può essere "=", "@=" o "~=". <ul> <li> "=" richiede che il valore corrisponda esattamente all'attributo; </li> <li> "@=" richiede la parte dopo un "@" nell'attributo per corrispondere al valore; </li> <li> "~=" consente al valore di corrispondere a qualsiasi parte di qualsiasi elemento nella matrice di attributi. </li> </ul> Ad esempio: <br /> <i> staff:email,@=,dominio.it|admin:email,=,admin@gmail.com </i> <br /> garantirebbe a qualsiasi utente con un email *@dominio.it il ruolo staff e all'utente con l'attributo email esattamente corrispondente a admin@gmail.com il ruolo di amministratore.<br />Per attribuire a tutti un ruolo, per esempio guest, basta inserire <i>guest:name,~=,*</i>.

source: NOTE: This means users could lose any roles that have been assigned manually in Drupal.
it: NOTA: Questo significa che gli utenti possono perdere i ruoli assegnati a mano in Drupal.

source: Logged in as SPID user %authname<br /><a href=":logout">Log out</a>
it: Loggato come utente SPID %authname<br /><a href=":logout">Esci</a>

source: Warning: SPID module is not activated.
it: Avvertenza: il modulo SPID non è attivato.

source: We are sorry. While you have successfully authenticated, you are not yet entitled to access this site. Please ask the site administrator to provision access for you.
it: L'autenticazione è avvenuta con successo, ma non si è autorizzati ad accedere a questo sito.

source: We are sorry, your user account is not SAML enabled.
it: Siamo spiacenti, l'account utente non è abilitato SAML.

source: Error synchronizing mail: no email address is provided by SAML.
it: Errore durante la sincronizzazione dell'indirizzo email: nessun indirizzo email fornito da SPID.

source: We're sorry. There was a problem. The issue has been logged for the administrator.
it: C'è stato un errore.

source: metadata not found
it: metadata non trovati

source: connection url not found
it: url di connessione non trovato

source: Invalid destination
it: Destinazione non valida

source: Can't find IdP metadata
it: Impossibile trovare metadati IdP

source: Invalid data
it: Dati non conformi

source: time out of terms
it: tempo scaduto o non raggiunto

source: nothing to do
it: niente da fare

source: Invalid algorithm (
it: Algoritmo firma assente o non supportato (

source: Digest value is not valid
it: Valore digest non valido

source: Invalid signature
it: Firma digitale non valida

source: . Not a SAML request.
it: . Formato della richiesta non conforme alle specifiche SAML.

source: . Version parameter incorrect.
it: . Parametro version non presente, malformato o diverso da ‘2.0’.

source: . ID incorrect.
it: . Identificatore richiesta (ID) non presente, malformato o non conforme.

source: . RequestAuthnContext incorrect.
it: . RequestAuthnContext non presente, malformato o non previsto da SPID

source: . IssueInstant incorrect.
it: . IssueInstant non presente, malformato o non coerente con l'orario di arrivo della richiesta.

source: . destination incorrect.
it: . destination non presente, malformata o non coincidente con il Gestore della identità ricevente la richiesta

source: . isPassive incorrect.
it: . attributo isPassive presente e attualizzato al valore true

source: . AssertionConsumerService incorrect.
it: . AssertionConsumerService non correttamente valorizzato.

source: . NameIDPolicy/Format element incorrect.
it: . Attributo Format dell'elemento NameIDPolicy assente o non valorizzato secondo specifica.

source: . AttributeConsumerServiceIndex incorrect.
it: . AttributeConsumerServiceIndex malformato o che riferisce a un valore non registrato nei metadati di SP

source: . Credentials incorrect.
it: . Autenticazione fallita per ripetuta sottomissione di credenziali errate (superato numero tentativi secondo le policy adottate).

source: . Level mismatch.
it: . Utente privo di credenziali compatibili con il livello richiesto dal fornitore del servizio.

source: . Timeout.
it: . Timeout durante l'autenticazione utente.

source: . User denies consent.
it: . Utente nega il consenso all'invio di dati al SP in caso di sessione vigente.

source: . User credendials blocked.
it: . Utente con identit&agrave sospesa/revocata o con credenziali bloccate.

source: . User cancels request.
it: . Operazione annullata dall'utente.

source: . Unknown issue.
it: . Problema sconosciuto.

source: User %name disconnecting via SPID
it: Utente %name in disconnessione tramite SPID

source: failure on read private key
it: errore di lettura sulla chiave privata
