Repository: AaronFeledy/d9-drupal-check-allthemodules
Catalog: web/modules/contrib/translation_extractor/translations/*.po
Languages: de

source: Scan results
de: Ergebnisse

source: Save as %pofilename
de: Speichern als %pofilename

source: Language
de: Sprache

source: Select the language to generate the PO file for.
de: W채hle die Sprache, f체r die die PO-Datei generiert werden soll.

source: Remove row
de: Zeile entfernen

source: Weight
de: Gewichtung

source: Search patterns
de: Suchmuster

source: File extensions
de: Dateierweiterungen

source: The file extensions to include in the scan. One per line including the leading dot.
de: Die zu scannenden Dateierweiterungen. Eine Erweiterung pro Zeile, inklusive des Punktes.

source: PCRE pattern
de: PCRE Muster

source: Match number
de: Treffernummer

source: Module to scan
de: Zu scannendes Modul

source: Please choose
de: Bitte w채hlen

source: Start scan
de: Scan starten

source: Click @here to review/change the settings.
de: Zur Pr체fung der Einstellungen, @here klicken.

source: here
de: hier
