Repository: AaronFeledy/d9-drupal-check-allthemodules
Catalog: web/modules/contrib/views_field_percentage/translations/8.x-1.0.*.po
Languages: it

source: Render numeric field as percentage.
it: Renderizza un campo numerico come percentuale.

source: Current Value
it: Valore corrente

source: You must add some additional fields to this display before using this field. These fields may be marked as <em>Exclude from display</em> if you prefer. Note that due to rendering order, you cannot use fields that come after this field; if you need a field not listed here, rearrange your fields.
it: È necessario aggiungere alcuni campi aggiuntivi a questa visualizzazione prima di utilizzare questo campo. Questi campi possono essere contrassegnati come <em>esclusi dalla visualizzazione,</em> se si preferisce. Si noti che a causa dell'ordine di rendering, non è possibile utilizzare i campi che verranno dopo di questo; se si ha bisogno di un campo non elencato qui, riorganizzare i campi.

source: The following replacement tokens are available for this field. Note that due to rendering order, you cannot use fields that come after this field; if you need a field not listed here, rearrange your fields.
it: Per questo campo sono disponibili i seguenti token di sostituzione. Si noti che a causa di ordine di rendering, non è possibile utilizzare i campi che vengono dopo questo campo; Se hai bisogno di un campo non elencato qui, riorganizza i tuoi campi.

source: @argument title
it: @argument titolo

source: Arguments
it: Argomenti

source: Fields
it: Campi

source: Insert max value of range percentage.
it: Inserire il valore massimo della percentuale di intervallo.

source: Insert min value of range percentage.
it: Inserire il valore minimo della percentuale di intervallo.

source: Circle
it: Cerchio

source: Circle with percentage
it: Cerchio con percentuale

source: Chose percentage style.
it: Scegli lo stile percentuale.

source: Percentage views field.
it: Campo Percentuale della vista

source: Custom Global
it: Globale Custom

source: Percentage Style
it: Stile di visualizzazione della percentuale

source: Style
it: Stile

source: Min
it: Minimo

source: Max
it: Massimo
