Repository: AaronFeledy/d9-drupal-check-allthemodules
Catalog: web/modules/contrib/supermonitoring/translations/*.po
Languages: es

source: https://www.supermonitoring.com/
es: https://www.supermonitoring.es/

source: Your Checks
es: Sus pruebas

source: Your Account
es: Su cuenta

source: Your Contacts
es: Sus contactos

source: Configuration > User Interface > Super Monitoring
es: Configuración > Interfaz de usuario > Super Monitoring

source: Go to the configuration and enter your token
es: Ve a configuración e ingresa tu token

source: Authorization token
es: Token de autorización

source: If you already have a subscription at www.supermonitoring.com, enter your token to integrate the service with Drupal panel.<br /><br />If you have not an account at www.supermonitoring.com yet, <a href="https://www.supermonitoring.com/?utm_source=Drupal&utm_medium=text&utm_campaign=plugin" target="_blank"><strong>sign up here</strong></a> for a 14-day free trial.
es: Si ya tiene una suscripción a www.supermonitoring.es, introduzca su token de integrar el servicio con el panel de Drupal.<br /><br />Si usted no tiene una cuenta en www.supermonitoring.es todavía, <a href="https://www.supermonitoring.es/?utm_source=Drupal&utm_medium=text&utm_campaign=plugin" target="_blank"><strong>regístrese aquí</strong></a> para una prueba gratuita de 14 días.

source: Super Monitoring settings
es: Super Monitoring configuración

source: Monitor your website uptime with www.supermonitoring.com services - and have the reports displayed in your Drupal panel.
es: Supervise el tiempo de actividad de su blog con los servicios de www.supermonitoring.ed y haga que todos los gráficos y tablas aparezcan en su panel de Drupal.
