Repository: AaronFeledy/d9-drupal-check-allthemodules
Catalog: web/modules/contrib/cleverdrupal/translations/*.po
Languages: es, fr, it

source: Dashboard
es: Panel de control
fr: Tableaux de bord

source: Help & Support
es: Ayuda y soporte
fr: Aide & Support
it: Aiuto & Supporto

source: CleverReach® ID
es: ID del cliente de CleverReach®
fr: CleverReach® Numéro Client
it: ID cliente CleverReach®

source: An error occurred!
es: ¡Se ha producido un error!
it: ¡Se ha producido un error!

source: Error description
es: Descripción del error
it: Descripción del error

source: Retry synchronization now
es: Repita ahora transferencia de datos
it: Repita ahora transferencia de datos

source: Targeted email marketing for more revenue!
es: Correos personalizados para más ventas!
fr: Marketing par Email Ciblées pour réaliser plus de ventes!
it: E-mail marketing mirato per incrementare i profitti!

source: Create appealing emails to showcase your articles to your readers
es: Cree newsletters elegantes con sus productos a los clientes.
fr: Créer des mailings attractifs afin de présentez vos produits à vos clients.
it: Crea e-mail accattivanti per presentare i tuoi prodotti ai tuoi clienti

source: Create your first newsletter
es: Cree su primer newsletter
fr: Créer votre première newsletter
it: Crea la tua prima newsletter

source: Create your next newsletter now!
es: Cree el próximo newsletter ahora
fr: Créez maintenant votre prochaine Newsletters!
it: Crea ora la tua prossima newsletter!

source: Welcome to clever Email Marketing!
es: Bienvenido a CleverReach email marketing
fr: Bienvenue à CleverReach® - Intelligent Email Marketing
it: Benvenuti nel mondo dell'e-mail marketing intelligente

source: Simply transmit Drupal data and get started with CleverReach® for free!
es: Para iniciar el trabajo con Drupal y empezar sin gastos con CleverReach®
fr: Transférer tout simplement vos données Drupal et démarrez gratuitement avec CleverReach®!
it: Trasmetti i dati contenuti nella tua piattaforma Drupal e comincia gratuitamente ad usare CleverReach®!

source: Create and connect your new CleverReach® account now!
es: Cree y conecte con una cuenta de CleverReach®
fr: Créer et connecter dès maintenant votre nouveau compte CleverReach®!
it: Crea e connetti adesso il tuo nuovo account CleverReach®!

source: Log in and connect with an existing CleverReach® account
es: Inicie sesión y conecte con una cuenta existente de CleverReach®
fr: Identifiez et connectez-vous à votre compte CleverReach®
it: Accedi e connettiti ad un account CleverReach® esistente

source: Connecting...
es: Conectando...
fr: La connexion est établie...
it: Connessione...

source: Create recipient list in CleverReach®
es: Cree una lista de destinatarios en CleverReach®
fr: Créer une liste d'abonnés dans CleverReach®
it: Crea un elenco di destinatari in CleverReach®

source: Add data fields, segments and tags to recipient list
es: Añada campos de datos, segmentos y etiquetas a la lista de destinatarios
fr: Ajouter des champs de données, des segments et des Balises à liste d'abonnés
it: Aggiungi campi, segmenti e tag alle tue liste di destinatari

source: Import recipients from Drupal to CleverReach®
es: Importe de destinatarios de Drupal a CleverReach®
fr: Importer vos destinataires de Drupal à CleverReach®
it: Importa i destinatari da Drupal in CleverReach®

source: Well done!
es: ¡Bien hecho!
fr: Bien fait!
it: Ben fatto!

source: %s recipients have been successfully added to the list %s in your CleverReach® account.
es: %s los destinatarios se han añadido con éxito a la lista %s en su cuenta de CleverReach
fr: %s destinataires ont été ajoutés avec succès à la liste %s de votre compte CleverReach®.
it: %s destinatari sono stati aggiunti con successo alla lista %s nel tuo account CleverReach®.

source: You will be directed to your plugin dashboard in ... %d sec.
es: Usted será dirigido a nuestro plugin dashboard en... %d sec..
fr: Vous serez redirigé vers votre tableau de bord plugin dans ...%d sec.
it: Sarai reindirizzato all tua dashboard di plugin in... %d sec.

source: Subscribe to newsletter
es: Suscribir newsletter
fr: S´abonner aux newsletters
it: Iscriversi alla newsletter

source: Subscribed to newsletter
es: Newsletter suscribido
fr: inscrit aux Newsletters
it: Iscritto alla newsletter

source: Author
es: Autor
fr: Auteur
it: Autore

source: Date
es: Fecha
it: Data

source: CleverReach® Email Marketing Tool
es: Solución de email marketing
fr: CleverReach® outil d´email marketing
it: Tool di e-mail marketing di CleverReach®

source: Access CleverReach® module options.
es: Acceso a las opciones del software de CleverReach®.
fr: Accès aux options du logiciel CleverReach®.
it: Accedi alle opzioni del modulo CleverReach®.

source: Targeted email marketing for more readers in your Drupal CMS
es: Email marketing para más lectores en su CMS Drupal
fr: Email marketing ciblé pour plus de lecteurs dans votre CMS Drupal
it: Un e-mail marketing mirato per avere più lettori nel tuo CMS Drupal

source: If this option is set, all users that existed before CleverReach initial synchronization will be synced as Active. CleverReach module add newsletter subscription status so you can later set this per user.
es: Si esta opción está activada, los usuarios estan sincronizado como activo. El modulo CleverReach® se añade el estado de la suscripción de correo electrónico. Así se puede eligirlo pro usuario.
fr: Si vous avez sélectionné cette option, tous les utilisateurs qui existaient avant la première synchronisation de CleverReach seront synchronisés comme actifs. CleverReach ajoute le statut d'abonnement aux newsletters afin que vous puissiez le configurer ultérieurement pour chaque utilisateur.
it: Se viene scelta questa opzione, tutti gli utenti esistenti prima della sincronizzazione iniziale di CleverReach® verranno sincronizzati come Attivi. Il modulo CleverReach® aggiunge lo status di registrazione alla newsletter in modo che tu possa modificarlo per ogni utente in un secondo momento.

source: Current users should be synced as Active
es: Transmitir usuarios con estado activo
fr: Les utilisateurs en cours doivent être transférés come actifs
