Repository: AaronFeledy/d9-drupal-check-allthemodules
Catalog: web/modules/contrib/pause_player/translations/*.po
Languages: fr

source: Title of the video
fr: Titre de la vidéo

source: If the value is empty, the title associated with the field will be used
fr: Si la valeur est vide, le titre associé au champ sera utilisé

source: Description of the video
fr: Description de la vidéo

source: Force ratio only for correct the size of the video
fr: Force le ration dans le but de corriger la taille de la vidéo

source: Image path
fr: Chemin de l'image

source: Path of an image that will be associated with the video
fr: Chemin d'une image qui sera associée à la vidéo

source: Width
fr: Largeur

source: Specify a number value and its unit. Ex : 480, 480px, 100%
fr: Spécifier une valeur nombre et son unité. Ex : 480, 480px, 100%

source: Height
fr: Hauteur

source: Specify a number value and its unit. Ex : 270, 270px, 100%
fr: Spécifier une valeur nombre et son unité. Ex : 270, 270px, 100%

source: CSS classes
fr: Classes CSS

source: Adds CSS classes on the HTML element container of the video player
fr: Ajoute des classes CSS à l'élément HTML conteneur du lecteur vidéo

source: Appear mode
fr: Mode d'apparition

source: Default (animation visible immediate)
fr: Défaut (animation visible immédiatement)

source: On preload (player appear when preload of the first video is complete)
fr: Au chargement (le lecteur apparaît lorsque le chargement de la première vidéo est complet)

source: On play (launched by play button)
fr: A la lecture (lancée par le bouton de lecture)

source: Autoplay
fr: Lecture automatique

source: Player background color
fr: Couleur de fond du lecteur

source: HTML colors : blue, #4682B4, transparent...
fr: Couleurs HTML : blue, #4682B4, transparent...

source: Controls display mode
fr: Mode d'affichage des contrôles

source: All the time
fr: En tout temps

source: Disappear
fr: Disparaît

source: Never
fr: Jamais

source: Looping
fr: Répétition

source: None
fr: Aucune

source: All videos
fr: Toutes les vidéos

source: Video 1
fr: Vidéo 1

source: Video 2
fr: Vidéo 2

source: Video 3
fr: Vidéo 3

source: Video 4
fr: Vidéo 4

source: Default volume
fr: Volume par défaut

source: Mute
fr: Rendre muet

source: Preload time
fr: Temps de pré-chargement

source: Preload time before playback (in seconds).
fr: Temps de pré-chargement avant la lecture (en secondes).

source: Play button display
fr: Affichage du bouton de lecture

source: Both
fr: Les deux

source: Start
fr: Au début

source: End
fr: A la fin

source: Video display mode
fr: Mode d'affichage de la vidéo

source: Default
fr: Défaut

source: No resize
fr: Sans redimensionnement

source: Stretch
fr: Etirer

source: Cover (no black bars)
fr: Couvrir (sans bandes noires)

source: Video display mode inside the video player
fr: Mode d'affichage de la vidéo à l'intérieur du lecteur

source: Debug
fr: Débogage

source: If debug is activated, informations about the playing are added to the browser console
fr: Si le débogage est activé, les informations de lecture sont ajoutées à la console du navigateur

source: I have the commercial version
fr: J'ai la version commerciale

source: Start content mode
fr: Mode du contenu de démarrage

source: Video image
fr: Image de la vidéo

source: Web image
fr: Image Web

source: Sets a startup content that will be displayed before playing video
fr: Définit un contenu de démarrage qui s'affichera avant la lecture de la vidéo

source: Start content display mode
fr: Mode d'affichage du contenu de démarrage

source: Display mode of the image in the frame of the video container
fr: Mode d'affichage de l'image dans le cadre du conteneur vidéo

source: Start content image path
fr: Chemin de l'image du contenu de démarrage

source: Path of the image if the 'Web image' mode is selected
fr: Chemin de l'image si le mode 'Image Web' est sélectionné

source: End content mode
fr: Mode du contenu de fin

source: Sets an ending content that will be displayed when the video playback stops
fr: Définit un contenu de fin qui s'affichera lorsque la lecture de la vidéo stoppera

source: End content display mode
fr: Mode d'affichage du contenu de fin

source: End content image path
fr: Chemin de l'image du contenu de fin

source: Disappear mode
fr: Mode de disparition

source: None (no end content)
fr: Aucun (sans contenu de fin)

source: At end (when end of the playing of all videos)
fr: A la fin (lorsque la lecture de toutes les vidéos est terminée)

source: On stop
fr: A l'arrêt

source: On pause
fr: A la pause

source: Endcontent displayed when player disappear
fr: Le contenu de fin est affiché lorsque le lecteur disparaît
